"""


12. Присвоїти змінній k анонімну ф-цію, яка додає два переданих числа.

13. Заданий масив чисел (float або / і int). Вам потрібно знайти різницю між найбільшим (максимум) і самим малим (мінімум) елементом. Ваша функція повинна вміти працювати з невизначеною кількістю аргументів.

14. Заданий рядок зі словами і числами, розділеними пробілами (один пробіл між словами та / або числами). Слова складаються тільки з букв. Вам потрібно перевірити чи є у вихідному рядку три слова підряд. Наприклад, в рядку "start 9 one two three 7 end" є три слова підряд. Відповідь як логічне значення (bool),
True або False.
16. Використовуючи генератор списків - згенерувати список від 1 до 1000, допускаючи лише ті елементи які кратні 3 та 5.

17. Написати власний декоратор який перед виконанням функції буде виводити сьогоднішню дату.
Підказка - from datetime import datetime. Це імпорт модуля.
А щоб вивести саму дату - datetime.today().strftime('%Y-%m-%d')

18. Написати власний декоратор, який у якості аргумента буде приймати стрічку і виводитиме її великими буквами перед виконанням функції (test -> TEST)
та після виконання функції.

19. Написати власну функцію генератор, яка буде повертати наступне число із діапазону 10.
"""
# 11. Написати довільну функцію, використовуючи формальний параметр *kwargs.
# items() - Метод используется, когда нужно перебрать значения словаря
def intro(**data):
    print("\nData type of argument: ",type(data))

    for key, value in data.items():
        print(f'{key} is {value}')

intro(Firstname="Sita", Lastname="Sharma", Age=22, Phone=1234567890)