# """
# Составьте программу, которая формировала бы правильное окончание слова "ворона"
# в сочетании с заданным натуральным N.
# Например, 21 ворона. 12 ворон, 43 вороны и т.д.
# Для взрослых - то же в любой валюте (3 доллара, 5 долларов и т.д.)
# ворон == 5,6,7,8,9,10,11 12,13,14,15,16,17,18,19,20  26,27,28,29,30 35,36,37,38,39,40
# вороны == 2,3,4, 22,23,24
# """
#
#
# def input_number(num):
#     # list_na = [i for i in range(1, 1002, 10) if i not in range(11, 1002, 100)]
#     # list_n = [i for i in range(5, 1002) if i not in range(21, 24)]  # покрыт лишь диапазон 5-20
#     # list_ni = [i for i in range(2, 1002) if i not in range(5, 21)]  # покрыт лишь диапазон 2-5
#
#     # p = num%10
#     # if num > 4 and num < 21:
#     #     print(f'{num} ворон')
#     # elif num  > 9 :
#     #     if p == 0:
#
#     if num in list_na:
#         print(f'{num} ворона')
#     if num in list_n:
#         print(f'{num} ворон')
#     if num in list_ni:
#         print(f'{num} вороны')
#
#
# input_number(25)
